# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors: 
  #- [10,9, 12,12, 15,14, 20,20]  # P2/4
  #- [25,28, 35,20, 45,41, 41,45]  # P3/8
  #- [80,86, 98,56 , 110,110, 56,98]  # P4/16
  #- [215,106, 580,343, 106,215, 343,580]  # P5/32
  - [9,9, 12,12, 14,13, 16,15 ,20,20]  # P2/4
  - [37,22, 25,29, 45,41 ,27,19, 19,27]  # P3/8
  - [46,40, 79,86 , 97,55, 86,79 , 55,97]  # P4/16
  - [110,109, 578,343 ,211,96 ,96,211 ,109,110]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],#/32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#/16
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],#/16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P38
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],#/8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 24
   [-1, 3, C3, [128, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4 /8
   [-1, 3, C3, [256, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5 /16
   [-1, 3, C3, [512, False]],  # 23 (P5/32-

   [-1, 1, Conv, [512, 3, 2]],#/32
   [[-1, 9], 1, Concat, [1]],  # cat head P5 /16
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[21, 24, 27,30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
